## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             RESOURCE                              |
|--------|-------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.superset_privileged_role_grant` |
|        | `aws_cloudwatch_metric_alarm.superset_privileged_role_grant`      |
|        | `aws_cloudwatch_query_definition.superset_privileged_role_grant`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.superset_privileged_role_grant will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_privileged_role_grant" {
      + id             = (known after apply)
      + log_group_name = "/aws/rds/cluster/superset-prod-cluster/postgresql"
      + name           = "privileged-role-grant"
      + pattern        = (sensitive value)
      + region         = "ca-central-1"

      + metric_transformation {
          + default_value = "0"
          + name          = "privileged-role-grant"
          + namespace     = "superset"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.superset_privileged_role_grant will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_privileged_role_grant" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "Privileged role was granted in Superset."
      + alarm_name                            = "privileged-role-grant"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "privileged-role-grant"
      + namespace                             = "superset"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.superset_privileged_role_grant will be created
  + resource "aws_cloudwatch_query_definition" "superset_privileged_role_grant" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/rds/cluster/superset-prod-cluster/postgresql",
        ]
      + name                = "Superset - privileged role grant"
      + query_definition_id = (known after apply)
      + query_string        = (sensitive value)
      + region              = "ca-central-1"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/athena_access_logs/athena_access_logs/locals.tf line 6, in locals:
   6:   region     = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 14 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
resource instead.

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.superset_privileged_role_grant"]

24 tests, 18 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
